; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
(define (problem blocksworld-94)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 - object)
 (:init 
    (arm-empty)
    (clear b24)
    (on b24 b5)
    (on b5 b9)
    (on b9 b2)
    (on b2 b16)
    (on b16 b25)
    (on b25 b4)
    (on b4 b8)
    (on b8 b15)
    (on b15 b28)
    (on b28 b27)
    (on b27 b18)
    (on b18 b12)
    (on-table b12)
    (clear b26)
    (on b26 b1)
    (on b1 b14)
    (on b14 b22)
    (on b22 b10)
    (on b10 b11)
    (on b11 b23)
    (on b23 b17)
    (on-table b17)
    (clear b20)
    (on b20 b6)
    (on b6 b21)
    (on-table b21)
    (clear b13)
    (on b13 b19)
    (on b19 b7)
    (on b7 b3)
    (on-table b3))
 (:goal (and 
(on b9 b19)
))
)

; plan
1. (unstack b24 b5)
   deleted: (on b24 b5) (clear b24) (arm-empty)
   added: (holding b24) (clear b5)
   goals met: 0 of 1
2. (putdown b24)
   deleted: (holding b24)
   added: (clear b24) (arm-empty) (on-table b24)
   goals met: 0 of 1
3. (unstack b5 b9)
   deleted: (on b5 b9) (clear b5) (arm-empty)
   added: (holding b5) (clear b9)
   goals met: 0 of 1
4. (putdown b5)
   deleted: (holding b5)
   added: (clear b5) (arm-empty) (on-table b5)
   goals met: 0 of 1
5. (unstack b13 b19)
   deleted: (on b13 b19) (clear b13) (arm-empty)
   added: (holding b13) (clear b19)
   goals met: 0 of 1
6. (putdown b13)
   deleted: (holding b13)
   added: (clear b13) (arm-empty) (on-table b13)
   goals met: 0 of 1
7. (unstack b9 b2)
   deleted: (on b9 b2) (clear b9) (arm-empty)
   added: (holding b9) (clear b2)
   goals met: 0 of 1
8. (stack b9 b19)
   deleted: (clear b19) (holding b9)
   added: (arm-empty) (clear b9) (on b9 b19)
   goals met: 1 of 1
